Revit 2027 API
BuiltInFailures.DimensionFailures.RadialDimensionChangeRadiusFailed Property
 Can't change radius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RadialDimensionChangeRadiusFailed { get; }
Public Shared ReadOnly Property RadialDimensionChangeRadiusFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RadialDimensionChangeRadiusFailed {
	FailureDefinitionId^ get ();
}
static member RadialDimensionChangeRadiusFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace